pmo-dataset/mermaid/29.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1((" ")) --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_1 --> Manual_6["Check requirements\nand point for\nskilled workers in\nshortage occupations"]
	ExclusiveGateway_1 --> Manual_1["Check requirements\nand point for\nparticularly highly\nqualified people"]
	ExclusiveGateway_1 --> Manual_5["Check requirements\nand point for other\nkey employees"]
	ExclusiveGateway_1 --> Manual_3["Check requirements\nand point for\nstart-up founders"]
	Manual_6 --> ExclusiveGateway_2{"Fullfiles the\nrequirements or\npoint?"}
	Manual_1 --> ExclusiveGateway_2
	Manual_5 --> ExclusiveGateway_2
	Manual_3 --> ExclusiveGateway_2
	Manual_2["Check requirements\nfor independent key\nemployees"] --> ExclusiveGateway_2
	ExclusiveGateway_2 -->|"No"| ExclusiveGateway_1
	User_1["Check if passport is\nup to date"] --> ExclusiveGateway_3{"X"}
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_4{"X"}
	Manual_7["Request new passport"] --> ExclusiveGateway_4
	User_2["Prepare Documents\nfor r-w-r card"] --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> User_1
	ParallelGateway_1 --> Manual_8["Make passport photo"]
	ParallelGateway_1 --> Manual_9["Prepare birth\ncertificate"]
	Manual_10["Search and find\nsuited apartment"] --> Manual_11["Negotiate rent with\nlandlord"]
	ExclusiveGateway_5{"X"} --> Manual_10
	ParallelGateway_1 --> ExclusiveGateway_5
	Manual_11 --> ExclusiveGateway_6{"Negotitation\nsuccessful?"}
	ExclusiveGateway_6 -->|"No"| ExclusiveGateway_5
	ExclusiveGateway_6 -->|"Yes"| Manual_12["Sign contract"]
	ParallelGateway_1 --> Manual_14["Gather documentation\nto prove financial\nindepence"]
	ParallelGateway_1 --> Manual_15["Application for a\nresidence permit"]
	Manual_8 --> ParallelGateway_2{"+"}
	ExclusiveGateway_4 --> ParallelGateway_2
	Manual_9 --> ParallelGateway_2
	Manual_14 --> ParallelGateway_2
	Manual_15 --> ParallelGateway_2
	Manual_12 --> ParallelGateway_2
	ExclusiveGateway_7{"X"} --> User_2
	ExclusiveGateway_3 -->|"No"| Manual_7
	ParallelGateway_1 --> Manual_13["Request Austrian\nhealth insurance\ncoverage incl.\ndocumentation"]
	Manual_13 --> ParallelGateway_2
	Service_1["Send documentation\nto relevant agency"] --> Service_2["Rules engine\nautomaticly checks\nif documentations\nfullfilles\nrequirements"]
	Service_2 --> ExclusiveGateway_8{"Additional\ndocumentation\nneeded?"}
	Service_3["Bank Systems creates\nbank account and\nsends E-Mail\nconfirmation"] --> ExclusiveGateway_9{"X"}
	ExclusiveGateway_9 --> EndNoneEvent_1((" ")):::endEvent
	ParallelGateway_2 --> Service_1
	ExclusiveGateway_8 -->|"No"| ExclusiveGateway_10{"Agency approves\nright to stay?"}
	ExclusiveGateway_8 -->|"Yes"| ExclusiveGateway_7
	Manual_16["Request Bank Account\non Bank website"] --> Service_3
	ExclusiveGateway_10 -->|"Yes"| Manual_16
	ExclusiveGateway_10 -->|"No"| ExclusiveGateway_9
	ExclusiveGateway_2 -->|"Yes"| ExclusiveGateway_7
	ExclusiveGateway_1 --> Manual_2
	ExclusiveGateway_1 --> Manual_4["Check requirements\nfor Graduates of an\nAustrian higher\neducation\ninstitution"]
	Manual_4 --> ExclusiveGateway_2
