pmo-dataset/variations/graphviz_with_ids/29.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="Check if passport is\nup to date"];
  "User_2" [label="Prepare Documents\nfor r-w-r card"];
  "Service_1" [label="Send documentation\nto relevant agency"];
  "Service_2" [label="Rules engine\nautomaticly checks\nif documentations\nfullfilles\nrequirements"];
  "Service_3" [label="Bank Systems creates\nbank account and\nsends E-Mail\nconfirmation"];
  "Manual_1" [label="Check requirements\nand point for\nparticularly highly\nqualified people"];
  "Manual_2" [label="Check requirements\nfor independent key\nemployees"];
  "Manual_3" [label="Check requirements\nand point for\nstart-up founders"];
  "Manual_4" [label="Check requirements\nfor Graduates of an\nAustrian higher\neducation\ninstitution"];
  "Manual_5" [label="Check requirements\nand point for other\nkey employees"];
  "Manual_6" [label="Check requirements\nand point for\nskilled workers in\nshortage occupations"];
  "Manual_7" [label="Request new passport"];
  "Manual_8" [label="Make passport photo"];
  "Manual_9" [label="Prepare birth\ncertificate"];
  "Manual_10" [label="Search and find\nsuited apartment"];
  "Manual_11" [label="Negotiate rent with\nlandlord"];
  "Manual_12" [label="Sign contract"];
  "Manual_13" [label="Request Austrian\nhealth insurance\ncoverage incl.\ndocumentation"];
  "Manual_14" [label="Gather documentation\nto prove financial\nindepence"];
  "Manual_15" [label="Application for a\nresidence permit"];
  "Manual_16" [label="Request Bank Account\non Bank website"];
  "StartNoneEvent_1" [shape=circle, label=""];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label=""];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="Fullfiles the\nrequirements or\npoint?"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="Negotitation\nsuccessful?"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="Additional\ndocumentation\nneeded?"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "ExclusiveGateway_10" [shape=diamond, label="Agency approves\nright to stay?"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Manual_6";
  "ExclusiveGateway_1" -> "Manual_1";
  "ExclusiveGateway_1" -> "Manual_5";
  "ExclusiveGateway_1" -> "Manual_3";
  "Manual_6" -> "ExclusiveGateway_2";
  "Manual_1" -> "ExclusiveGateway_2";
  "Manual_5" -> "ExclusiveGateway_2";
  "Manual_3" -> "ExclusiveGateway_2";
  "Manual_2" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1" [label="No"];
  "User_1" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="Yes"];
  "Manual_7" -> "ExclusiveGateway_4";
  "User_2" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "User_1";
  "ParallelGateway_1" -> "Manual_8";
  "ParallelGateway_1" -> "Manual_9";
  "Manual_10" -> "Manual_11";
  "ExclusiveGateway_5" -> "Manual_10";
  "ParallelGateway_1" -> "ExclusiveGateway_5";
  "Manual_11" -> "ExclusiveGateway_6";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5" [label="No"];
  "ExclusiveGateway_6" -> "Manual_12" [label="Yes"];
  "ParallelGateway_1" -> "Manual_14";
  "ParallelGateway_1" -> "Manual_15";
  "Manual_8" -> "ParallelGateway_2";
  "ExclusiveGateway_4" -> "ParallelGateway_2";
  "Manual_9" -> "ParallelGateway_2";
  "Manual_14" -> "ParallelGateway_2";
  "Manual_15" -> "ParallelGateway_2";
  "Manual_12" -> "ParallelGateway_2";
  "ExclusiveGateway_7" -> "User_2";
  "ExclusiveGateway_3" -> "Manual_7" [label="No"];
  "ParallelGateway_1" -> "Manual_13";
  "Manual_13" -> "ParallelGateway_2";
  "Service_1" -> "Service_2";
  "Service_2" -> "ExclusiveGateway_8";
  "Service_3" -> "ExclusiveGateway_9";
  "ExclusiveGateway_9" -> "EndNoneEvent_1";
  "ParallelGateway_2" -> "Service_1";
  "ExclusiveGateway_8" -> "ExclusiveGateway_10" [label="No"];
  "ExclusiveGateway_8" -> "ExclusiveGateway_7" [label="Yes"];
  "Manual_16" -> "Service_3";
  "ExclusiveGateway_10" -> "Manual_16" [label="Yes"];
  "ExclusiveGateway_10" -> "ExclusiveGateway_9" [label="No"];
  "ExclusiveGateway_2" -> "ExclusiveGateway_7" [label="Yes"];
  "ExclusiveGateway_1" -> "Manual_2";
  "ExclusiveGateway_1" -> "Manual_4";
  "Manual_4" -> "ExclusiveGateway_2";
}
